# Housing Market

### Introduction:

This time we will create our own dataset with fictional numbers to describe a house market. As we are going to create random data don't try to reason of the numbers.

### Step 1. Import the necessary libraries

In [1]:
import pandas as pd 
import numpy as np

### Step 2. Create 3 differents Series, each of length 100, as follows: 
1. The first a random number from 1 to 4 
2. The second a random number from 1 to 3
3. The third a random number from 10,000 to 30,000

In [2]:
s1 = pd.Series(np.random.randint(1,4,100))
s2 = pd.Series(np.random.randint(1,3,100))
s3 = pd.Series(np.random.randint(10000,30000,100))

### Step 3. Let's create a DataFrame by joinning the Series by column

In [4]:
df = pd.concat([s1,s2,s3], axis=1)
df

    0  1      2
0   1  1  13899
1   2  1  11678
2   3  2  12439
3   3  2  18570
4   2  1  14934
.. .. ..    ...
95  3  1  17635
96  2  2  19664
97  2  2  14131
98  1  2  28056
99  3  2  20496

[100 rows x 3 columns]

### Step 4. Change the name of the columns to bedrs, bathrs, price_sqr_meter

In [5]:
df.columns = ['bedrs', 'bathrs', 'price_sqr_meter']
df

    bedrs  bathrs  price_sqr_meter
0       1       1            13899
1       2       1            11678
2       3       2            12439
3       3       2            18570
4       2       1            14934
..    ...     ...              ...
95      3       1            17635
96      2       2            19664
97      2       2            14131
98      1       2            28056
99      3       2            20496

[100 rows x 3 columns]

### Step 5. Create a one column DataFrame with the values of the 3 Series and assign it to 'bigcolumn'

In [10]:
df2 = pd.DataFrame(pd.concat([s1,s2,s3], axis=0))
df2

        0
0       1
1       2
2       3
3       3
4       2
..    ...
95  17635
96  19664
97  14131
98  28056
99  20496

[300 rows x 1 columns]

### Step 6. Oops, it seems it is going only until index 99. Is it true?

In [ ]:
'yes'

### Step 7. Reindex the DataFrame so it goes from 0 to 299

In [11]:
df2.reset_index(inplace=True)
df2

     index      0
0        0      1
1        1      2
2        2      3
3        3      3
4        4      2
..     ...    ...
295     95  17635
296     96  19664
297     97  14131
298     98  28056
299     99  20496

[300 rows x 2 columns]